; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 219557 2 1 2 3 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image0 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Planet6 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon4)
)
(:goal (and
	(have_image Planet3 image0)
	(have_image Phenomenon4 image0)
	(have_image Star5 image0)
	(have_image Planet6 spectrograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 4
3. (turn_to satellite0 star0 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star0)
   goals met: 0 of 4
4. (turn_to satellite1 planet6 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet6)
   goals met: 0 of 4
5. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 4
6. (turn_to satellite1 planet3 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet3)
   goals met: 0 of 4
7. (turn_to satellite0 star5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star5)
   goals met: 0 of 4
8. (turn_to satellite1 phenomenon4 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 phenomenon4)
   goals met: 0 of 4
9. (take_image satellite0 star5 instrument0 image0)
   added: (have_image star5 image0)
   goals met: 1 of 4
10. (turn_to satellite1 planet3 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet3)
   goals met: 1 of 4
11. (turn_to satellite0 planet6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet6)
   goals met: 1 of 4
12. (turn_to satellite1 phenomenon4 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 phenomenon4)
   goals met: 1 of 4
13. (take_image satellite0 planet6 instrument0 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 2 of 4
14. (turn_to satellite1 groundstation2 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 groundstation2)
   goals met: 2 of 4
15. (turn_to satellite0 planet3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet3)
   goals met: 2 of 4
16. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 2 of 4
17. (take_image satellite0 planet3 instrument0 image0)
   added: (have_image planet3 image0)
   goals met: 3 of 4
18. (turn_to satellite1 phenomenon4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon4)
   goals met: 3 of 4
19. (take_image satellite1 phenomenon4 instrument1 image0)
   added: (have_image phenomenon4 image0)
   goals met: 4 of 4
